{
    "dico": [
        {
            "requete": "Quelle est la pollution par compagnie par rapport aux vols touristiques ?",
            "graph": "./images/pollution_compagnies.png",
            "analyse": "- La compagnie University Air Squadron émet 1,2 millions de kilos de CO2 et se retrouve en 1ère place du classement.\n- La compagnie South African Airways émet un peu moins d'1,2 millions de kilos de CO2 et se retrouve en 2nde place du classement.\n- La compagnie American Airlines émet 1 million de kilos de CO2 et se retrouve en 3ème place du classement.\n- La compagnie Kaiser Air émet aussi environ 1 million de kilos de CO2 et se retrouve en 4ème place du classement.\n- La compagnie Lufthansa Technik émet 990,9 mille kilos de CO2 et se retrouve en 5ème place du classement.",
            "explication": "/"
        },{
            "requete": "Quelle est la pollution totale des départs par pays ?",
            "graph": "./images/pollution_pays_dep.png",
            "analyse": "Nous avons donc ici un classement des pays émettant le plus de CO2 par rapport au départs d'avions dans ces pays en question. Nous avons décidé de n'afficher que les 10 premiers pour avoir un graphique compréhensible. \n- Les États-Unis sont le pays avec la plus grande quantité d'émissions de pollution, totalisant environ 3,358 millions de kilos de CO2.\n- L'Angleterre occupe la deuxième place avec environ 2,138 millions de kilos.\n- L'Allemagne est le troisième pays le plus pollueur avec environ 2,097 millions de kilos.\n- L'Espagne, la France, l'Italie, la Chine, le Canada, les Pays-Bas et la Russie complètent le top 10 des pays les plus pollueurs.",
            "explication": "Plusieurs causes peuvent expliquer ce classement.\n- Activités industrielles : Les pays ayant une forte activité industrielle, notamment dans des secteurs tels que la production d'énergie, l'industrie manufacturière, l'exploitation minière, peuvent avoir des émissions de pollution élevées. Par exemple, les États-Unis, l'Angleterre et l'Allemagne sont tous des pays industrialisés avec de grandes économies.\n- Taille de la population : Les pays avec une population plus importante ont souvent une demande énergétique plus élevée, ce qui peut entraîner des émissions de pollution plus élevées. Par exemple, la Chine qui a une population très importante, figurent dans le top 10 des pays les plus pollueurs.\n- Mix énergétique : Les pays qui dépendent fortement des combustibles fossiles tels que le charbon, le pétrole et le gaz naturel pour la production d'électricité et les besoins énergétiques ont tendance à avoir des émissions de pollution plus élevées. Cela peut être le cas de certains pays de ce classement.\n- Politiques environnementales : Les différences dans les politiques environnementales, telles que les réglementations sur les émissions, les incitations à l'adoption d'énergies propres, peuvent influencer les niveaux d'émissions de pollution d'un pays."
        },{
            "requete": "Quelle est la pollution totale des arrivées par pays ?",
            "graph": "./images/pollution_pays_arr.png",
            "analyse": "Cette fois, nous avons un classement des pays émettant le plus de CO2 par rapport au arrivées d'avions dans ces pays en question. Nous ne gardons toujours que les 10 premiers pour avoir un affichage correct.\n-  Les États-Unis restent le pays avec la plus grande quantité d'émissions de pollution, totalisant environ 3,330 millions de kilos. Malgré une légère diminution par rapport aux résultats précédents, les États-Unis conservent leur position en tant que principal émetteur de pollution.\n- L'Angleterre occupe toujours la deuxième place, avec environ 2,124 millions de kilos d'émissions. Tout comme les États-Unis, l'Angleterre maintient sa position, mais avec une légère diminution des émissions par rapport aux données précédentes.\n- L'Allemagne conserve sa position à la troisième place, avec environ 2,083 millions de kilos d'émissions.\n- L'Espagne se classe quatrième, avec environ 1,701 millions de kilos d'émissions.\n- La France, l'Italie, La Chine, le Canada, les Pays-Bas, et la Russie conservent également leurs positions respectives dans le top 10 des pays les plus pollueurs, avec des variations mineures dans leurs niveaux d'émissions.",
            "explication": "D'autres causes peuvent êtres prisent en compte pour expliquer ce classement. Activités économiques : Les pays qui ont une forte activité économique, avec des industries développées, des infrastructures touristiques et des échanges commerciaux importants, peuvent avoir un nombre plus élevé d'arrivées d'avions, ce qui peut conduire à des émissions de CO2 plus élevées. Par exemple, les États-Unis, l'Angleterre et l'Allemagne sont des économies majeures avec une forte présence dans le secteur du transport aérien.\n- Taille de la population et tourisme : Les pays avec une population importante et/ou une industrie touristique développée peuvent attirer un grand nombre de visiteurs internationaux, ce qui se traduit par un nombre élevé d'arrivées d'avions. Par conséquent, ils peuvent avoir des émissions de CO2 plus élevées liées au transport aérien. La Chine avec sa population importante, pourrait être de exemple de pays dans ce cas.\n- Connectivité aérienne : Les pays qui sont des hubs aériens majeurs ou qui ont des compagnies aériennes importantes peuvent voir un trafic aérien accru, ce qui peut contribuer à des émissions de CO2 plus élevées. Par exemple, le Royaume-Uni avec l'aéroport de Londres Heathrow peuvent être des pays qui bénéficient d'une connectivité aérienne importante."
        },{
            "requete": "Quelle est la pollution par passagers des vols longs pour le tourisme ?",
            "graph": "./images/pollution_sieges_long_tourisme.png",
            "analyse": "- Nous remarquons tout de suite que les avions contenant 9 places sont ceux qui émettent le plus de CO2 : 91 800 kilos par vol par passager.\n- Ensuite, nous retrouvons les avions à 37 places avec 17 300 kilos de CO2 par vol par passager.\n- En 3ème position, les avions à 122 places avec 4 300 kilos de CO2 par vol par passager.\n- Suivi de très près par les avions à  50 places qui eux émettent 4 200 kilos de CO2 par vol par passager.",
            "explication": "Tout d'abord, nous remarquons une valeur très étonnante, et après vérification, nous avons remarqué qu'il s'agit que d'un unique vol avec une pollution moyenne par passager par vol de 91 800 kilos de CO2. Il à une route de Sinop en Turquie jusqu'à Panama, ce qui est assez long et donc polluant, mais il n'est divisé que par 9 car il possède 9 places, ce qui pourrait expliquer cette valeur. Ensuite, on remarque qu'avec une augmentation du nombre de places, la moyenne de pollution diminue. Autrement dit, plus les avions possèdent de places, plus ils sont 'économiques'"
        },{
            "requete": "Quelle est la pollution par passagers des vols longs ?",
            "graph": "./images/pollution_sieges_long.png",
            "analyse": "Les avions contenant 2 sièges sont clairement ceux qui émettent le plus de CO2 : 250 200 kilos par vol par personne.\nLe reste est négligeable.",
            "explication": "Comme prévu, les avions 2 places sont ceux qui polluent le plus. En effet, ce sont des avions commerciaux ou de loisir qui consomment beaucoup et pour lesquels la moyenne sera divisée par le nombre de place : 2, ce qui est très faible et qui fait monter la moyenne. On remarque évidemment que plus le nombre de places augmente, plus la moyenne diminue."
        },{
            "requete": "Quelle est la pollution par passagers des vols moyens pour le tourisme ?",
            "graph": "./images/pollution_sieges_moyens_tourisme.png",
            "analyse": "- Nous remarquons à nouveau que les avions contenant 9 places sont ceux qui émettent le plus de CO2 : 11 000 kilos par vol par passager.\n- Ensuite, nous retrouvons les avions à 37 places avec 2 600 kilos de CO2 par vol par passager.\n- En 3ème position, les avions à  50 places avec 2 000 kilos de CO2 par vol par passager.",
            "explication": "Nous avons toujours cette valeur élevée pour les avions à 9 places, les raisons sont les même, le nombre de sièges étant faible, la moyenne est élevée. \nEnsuite, on remarque clairement ici qu'avec une augmentation du nombre de places, la moyenne de pollution diminue."
        },{
            "requete": "Quelle est la pollution par passagers des vols moyens ?",
            "graph": "./images/pollution_sieges_moyens.png",
            "analyse": "Les avions à 2 places consomment énormément par rapport au reste : 13 millions de kilos environ.\nLe reste est négligeable.",
            "explication": "Grâce à ces données, nous avons pu voir que pour les vols moyens, les avions de plus de deux places sont ce qui consomment le plus : 73,7 kilos. \nEn effet, ce sont des avions commerciaux ou de loisir qui consomment donc beaucoup et pour lesquels la moyenne sera divisée par deux (le nombre de places) ce qui est faible et donc augmente la moyenne. \nOn remarque évidemment que plus le nombre de places augmente, plus la moyenne diminue."
        },{
            "requete": "Quelle est la pollution par passagers des vols courts pour le tourisme ?",
            "graph": "./images/pollution_sieges_courts.png",
            "analyse": "Peu de consommation de CO2 pour les vols courts pour le tourisme",
            "explication": ""
        },{
            "requete": "Quelle est la pollution par passagers des vols courts ?",
            "graph": "./images/pollution_sieges_courts_tourisme.png",
            "analyse": "Les avions à 2 places consomment 20 000 kilos de CO2 environ.\nLe reste est négligeable.",
            "explication": "Nous remarquons encore une fois que la pollution en Co2 pour les avions de deux places est la plus forte : "
        },{
            "requete": "Quels sont les 10 types d'avions voyageant le plus ? ",
            "graph": "./images/avions_voyage.png",
            "analyse": "- Le type d'avion Airbus A320 effectue environ 14 000 voyages par cycle (un cycle équivaut à 2.5 jours selon une estimation de l'utilisation des 86 670 routes de la base de données d'OpenFlights)\n - Ensuite nous retrouvons environ 10 000 voyages de l'avion Boeing 737-800.\n - En 3ème position, nous avons l'avion Airbus A319 avec 8 000 voyages.\n - En 4ème position, 8 000 vols aussi pour le Boeing 737-700.\n - Les autres avions sont en dessous 5 000 vols.",
            "explication": "Les avions Airbus et Boeing sont conçues exprès pour les voyages à longue distance et pour le tourisme. C'est donc logique qu'ils soient en tête de ce classement."
        },{
            "requete": "Quels sont les 20 pays qui possèdent le plus d'aéroport ?",
            "graph": "./images/20_aeroport_pays.png",
            "analyse": "- Les Etats-Unis sont largement devant les autres pays avec 1 512 aéroports.\n - Le canada vient suivant avec 400 aéroports.\n - En 3ème position, nous avons l'Australie avec 334 aéroports.\n - En 4ème position, 264 aéroports pour le Brésil.\n - En 5ème position, 249 aéroports pour l'Allemagne.\n - Les autres pays sont en dessous 250 aéroports.",
            "explication": "Les États-Unis se classent en tête avec 1 512 aéroports. Les États-Unis possèdent un vaste territoire et une population importante, ce qui explique le nombre élevé d'aéroports. De plus, les États-Unis ont une économie développée et une forte demande de voyages nationaux et internationaux, ce qui nécessite un réseau aéroportuaire étendu.\n - Le Canada occupe la deuxième place avec 400 aéroports. Le Canada est le deuxième plus grand pays du monde en termes de superficie, avec une population relativement faible répartie sur une vaste étendue de territoire. Cette situation géographique unique et la nécessité de connecter des régions éloignées expliquent le nombre significatif d'aéroports au Canada.\n - L'Australie est en troisième position avec 334 aéroports. Tout comme le Canada, l'Australie est un pays vaste avec une population relativement faible. Les aéroports en Australie sont essentiels pour relier les différentes régions du pays, ainsi que pour soutenir le tourisme et les échanges commerciaux.\n - Le Brésil se classe quatrième avec 264 aéroports. Le Brésil est le pays le plus peuplé d'Amérique du Sud et possède également une superficie considérable. Le réseau aéroportuaire brésilien est crucial pour répondre aux besoins de déplacements dans un pays aussi vaste et pour soutenir les activités économiques et touristiques.\n - L'Allemagne se situe en cinquième position avec 249 aéroports. L'Allemagne est un pays densément peuplé situé au cœur de l'Europe. Elle bénéficie d'une position géographique centrale, ce qui en fait un important hub de transport en Europe. Les aéroports allemands jouent un rôle clé dans les voyages internationaux et les échanges commerciaux de la région."
        },{
            "requete": "Quels sont les 15 avions ayant les plus grands nombre de sieges ?",
            "graph": "./images/nom_des_15_avions_avec_le_plus_grand_nombre_de_sieges.png",
            "analyse": "- Le Boeing 747-400D est en 1ère position avec 660 sieges.\n- Le Boeing 747SR est en 1ere position ex aequo avec 660 sieges.\n- Le Boeing 747-8 est en 3ème position avec 605 sieges.\n- Le Boeing 747 est en 4ème position avec 580 sieges.\n- Le Airbus A380-800 est en 5ème position avec 555 sieges.",
            "explication": "Les Boeing, tout comme les Airbus, sont des avions conçus pour les trajets à longues distances. Nous retrouvons ces avions qui faisaient partie des avions les plus utilisés dans le trafic aérien. C'est donc logique qu'ils soient en tête de ce classement."
        },{
            "requete": "Quelles sont les 10 compagnies ayant les plus grand nombre de vols ?",
            "graph": "./images/10_compagnies_avec_le_plus_grand_nombre_de_vols.png",
            "analyse": "- La compagnie Abacus International est en 1ère position avec 7 632 vols.\n- La compagnie Abelag Aviation est en 2ème position avec 7 428 vols.\n- La compagnie Aviogenex est en 3ème position avec 7 203 vols.\n- La compagnie African Business and Transportations est en 4ème position avec 6 946 vols.\n- La compagnie Air Partner est en 5ème position avec 6 589 vols.",
            "explication": "Cela peut être dû à plusieurs facteurs tels que la taille de la flotte d'avions, le nombre de destinations desservies, la demande de voyages dans les régions où elle opère, et son positionnement sur le marché."
        },{
            "requete": "Quels sont les 10 pays ayant les plus grand d'arrivees ?",
            "graph": "./images/10_pays_ayant_le_plus_darrivees_davions_par_ordre_croissant.png",
            "analyse": "Nous retrouvons les Etats-Unis en 1ère position avec 20 890 arrivées par cycle.\n- La Chine est en 2ème position avec 9 101 arrivées.\n- L'Allemagne est en 3ème position avec 3 547 arrivées.\n- L'Angleterre est en 4ème position avec 3 349 arrivées.\n- L'Espagne est en 5ème position avec 2 550 arrivées.",
            "explication": "- Les États-Unis se classent en première position avec 20 890 arrivées par cycle. Les États-Unis étant un pays vaste et très fréquenté par les voyageurs, il est logique qu'ils occupent la première place en termes d'arrivées. Les États-Unis sont une destination populaire pour le tourisme, les voyages d'affaires et les liaisons internationales, ce qui explique le nombre élevé d'arrivées.\n- La Chine se positionne en deuxième place avec 9 101 arrivées par cycle. La Chine est également un pays à la fois vaste et densément peuplé, avec une économie en croissance et un secteur touristique en expansion. L'augmentation du nombre d'arrivées en Chine peut être attribuée à la croissance économique, aux investissements dans le secteur du tourisme et à l'ouverture progressive du pays aux visiteurs étrangers.\n- L'Allemagne occupe la troisième position avec 3 547 arrivées par cycle. L'Allemagne est une destination touristique populaire en Europe, grâce à ses villes historiques, sa culture riche et sa position centrale sur le continent. De plus, l'Allemagne est un important hub de transport, ce qui attire un nombre significatif de voyageurs en transit.\n- L'Angleterre se classe quatrième avec 3 349 arrivées par cycle. L'Angleterre, en tant que partie du Royaume-Uni, est également une destination touristique prisée, avec des attractions emblématiques comme Londres, son histoire riche et ses paysages variés. De plus, l'Angleterre est un centre d'affaires et un carrefour aérien important, attirant ainsi un grand nombre de visiteurs.\n- L'Espagne est en cinquième position avec 2 550 arrivées par cycle. L'Espagne est une destination touristique très populaire en raison de son climat méditerranéen, de ses plages, de sa riche culture et de ses sites historiques. Le pays accueille également de nombreux visiteurs internationaux grâce à ses infrastructures touristiques bien développées et à sa position géographique en tant que passerelle vers l'Europe."
        },{
            "requete": "Quelle est la pollution par compagnie ?",
            "graph": "./images/pollution_compagnies_2.png",
            "analyse": "- La compagnie Lufthansa Technik émet 4,6 millions de kilos de CO2 et se retrouve en 1ère place du classement.\n- La compagnie University Air Squadron émet un peu moins de 4,4 millions de kilos de CO2 et se retrouve en 2nde place du classement.\n- La compagnie American Airlines émet 3 millions de kilos de CO2 et se retrouve en 3ème place du classement.\n- La compagnie Savanair (Angola) émet environ 2,6 millions de kilos de CO2 et se retrouve en 4ème place du classement.\n- Enfin, la compagnie United States Air Force émet 2,6 millions de kilos de CO2 et se retrouve en 5ème place du classement.",
            "explication": "/"
        }
    ]
}